Приложение/Documents/ПокупкаЗаБонусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПокупкаЗаБонусы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиБонусов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Приложение/Documents/ПокупкаЗаБонусы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПокупкаПриИзмененииНаСервере()
	Объект.Сумма = Объект.Покупка.Стоимость;
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаПриИзменении(Элемент)
	ПокупкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Студент) Тогда
	
		 Объект.Группа = ПараметрыСеанса.ТекущийСтудент.Владелец.Ссылка;
		 Объект.Студент = ПараметрыСеанса.ТекущийСтудент.Ссылка;
	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли = Метаданные.Роли.Студент Тогда
	
		 Объект.Группа = ПараметрыСеанса.ТекущийСтудент.Владелец.Ссылка;
		 Объект.Студент = ПараметрыСеанса.ТекущийСтудент.Ссылка;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
